"""
Пожалуйста, запустите скрипт generate_practice_database.py прежде, чем приступать к выполнению практической работы. После выполнения скрипта у вас должен появиться файл базы practise.db
Урок 1, задание 2

Давайте начнём практику с более простого задания.

Есть база данных "practise.db", в которой есть таблица table_warehouse,
    которую мы видели на занятии.
Напишите функцию, которая принимает на вход объект курсор
    и добавляет в таблицу table_warehouse 10 различных записей.

"""
import sqlite3


def add_10_records_to_table_warehouse(cursor: sqlite3.Cursor) -> None:
    ...
