"""
Пожалуйста, запустите скрипт generate_practice_database.py прежде, чем приступать к выполнению практической работы. После выполнения скрипта у вас должен появиться файл базы practise.db
Вы программист в почтовом отделении деревни Малукса.

Известно, что ваша деревня весьма удалена от прочих населённых пунктов и дорогу в неё иногда размывает.
    Сейчас на дворе май и дорогу опять размыло!

Нужно написать SQL скрипт, который для всех почтовых доставок в мае перенесёт срок доставки на июнь,
    когда дорога как раз подсохнет.
"""
import sqlite3

sql_script_to_execute = "..."

if __name__ == "__main__":
    with sqlite3.connect("practise.db") as conn:
        cursor = conn.cursor()

        cursor.executescript(sql_script_to_execute)

        conn.commit()
