"""
С помощью команды ps можно посмотреть список процессов, запущенных текущим пользователем.
Особенно эта команда выразительна с флагами
    $ ps aux
Запустите эту команду, output сохраните в файл, например вот так
$ ps aux > output_file.txt
В этом файле вы найдёте информацию обо всех процессах, запущенных в системе.
В частности там есть информация о потребляемой процессами памяти - это столбец RSS .
Напишите в функцию python, которая будет на вход принимать путь до файла с output
и на выход возвращать суммарный объём потребляемой памяти в человеко-читаемом формате.
Это означает, что ответ надо будет перевести в байты, килобайты, мегабайты и тд.

Для перевода можете воспользоваться функцией _sizeof_fmt
"""
import os


def _sizeof_fmt(num, suffix="B"):
    for unit in ["", "Ki", "Mi", "Gi", "Ti", "Pi", "Ei", "Zi"]:
        if abs(num) < 1024.0:
            return "%3.1f%s%s" % (num, unit, suffix)
        num /= 1024.0
    return "%.1f%s%s" % (num, "Yi", suffix)


def get_summary_rss(ps_output_file_path: str) -> str:
    file = os.path.basename(ps_output_file_path)
    sum_size = 0
    with open(file, 'r') as f:
        for item in f:
            if item.split()[5].isdigit():
                sum_size += int(item.split()[5])
    return _sizeof_fmt(sum_size)


if __name__ == "__main__":
    ls_cmd = 'ps aux > output_file.txt'
    os.system(ls_cmd)
    print('Суммарный объём потребляемой памяти составляет ',
          get_summary_rss(os.path.join(os.getcwd(), "output_file.txt")))

